#### Importado y exportado de archivos csv

Primera parte del MySQL_MovieProject

In [1]:
import pandas as pd # Importamos las librerías
import numpy as np
import re
from datetime import datetime
from sqlalchemy import create_engine

In [2]:
pd.set_option('display.max_columns', None)  # ver todas las columnas

In [3]:
path = '../data/rental.csv'

rental = pd.read_csv(path)

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [4]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

* Con estas primeras 5 filas podemos ver que la fecha en la que se actualizan los nombres de cada actor son iguales. 
* Voy a comprobar si la varianza en la columna es baja o si hay pocos valores únicos si son todos iguales me voy a deshacer de ella.
* Parece que no hay ningún valor nulo
* Las columnas `rental_date` y `return_date` tienen tipo objeto - voy a pasarlas a tipo date time y crear tres columnas distintas year, month y day. Creo será util de cara a los querrys de luego.

In [5]:
# Procedo a ver los valores únicos de la columna:
rental.last_update.unique()

array(['2006-02-15 21:30:53'], dtype=object)

* Solo hay un tipo de valor en toda la columna -> me la puedo quitar con total confianza -> no nos aporta nada saber que los datos de los actores se actualizaron todos el mismo día y a la misma hora

In [6]:
rental.drop(columns='last_update', inplace=True)
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [7]:
rental.shape

(1000, 6)

Voy a pasar las columnas `rental_date` y `return_date` a tres columnas separadas `year`, `month` y `day`

In [8]:
rental.rental_date = pd.to_datetime(rental.rental_date)

In [9]:
rental.return_date = pd.to_datetime(rental.return_date)

In [10]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   datetime64[ns]
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   datetime64[ns]
 5   staff_id      1000 non-null   int64
dtypes: datetime64[ns](2), int64(4)
memory usage: 47.0 KB

In [11]:
# Ya con ambas columnas con tipo datetime voy a pasar a crear las nuevas 3 columnas de rental_date
rental['rental_year'] = pd.DatetimeIndex(rental.rental_date).year
rental['rental_month'] = pd.DatetimeIndex(rental.rental_date).month
rental['rental_day'] = pd.DatetimeIndex(rental.rental_date).day

In [12]:
# Ya con ambas columnas con tipo datetime voy a pasar a crear las nuevas 3 columnas de return_date
rental['return_year'] = pd.DatetimeIndex(rental.return_date).year
rental['return_month'] = pd.DatetimeIndex(rental.return_date).month
rental['return_day'] = pd.DatetimeIndex(rental.return_date).day

In [13]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,rental_year,rental_month,rental_day,return_year,return_month,return_day
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2005,5,24,2005,5,26
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2005,5,24,2005,5,28
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2005,5,24,2005,6,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2005,5,24,2005,6,3
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2005,5,24,2005,6,2

In [14]:
# Ya que estoy voy a sacar tambien la hora:
rental['rental_time'] = pd.DatetimeIndex(rental.rental_date).hour
rental['return_time'] = pd.DatetimeIndex(rental.return_date).hour
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,rental_year,rental_month,rental_day,return_year,return_month,return_day,rental_time,return_time
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2005,5,24,2005,5,26,22,22
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2005,5,24,2005,5,28,22,19
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2005,5,24,2005,6,1,23,22
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2005,5,24,2005,6,3,23,1
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2005,5,24,2005,6,2,23,4

In [15]:
# Pasamos el csv a nuestra carpeta data,llamándolo igual pero con un '_clean'
rental.to_csv('../data/rental_clean.csv', index=False)

In [16]:
str_conn = f'mysql+pymysql://root:password@localhost:3306/movieproject'
cursor = create_engine(str_conn)

In [18]:
rental.to_sql(name='rental',
            con=cursor,
            if_exists='replace',
            index=True)

1000